#include <cstring>
#include <iostream>
#include <cmath>
#include "Mat_NxN.h"

using namespace std;

// copy constructor(one argument)
Mat_NxN::Mat_NxN(const Mat_NxN& mat){
  memcpy(&dat[0][0], &mat, sizeof(T)*N*N);
}

// defoult constructor

// destructor

/*------------------- 代入演算子 ------------------- */




/*----------------- 複合代入演算子 ----------------- */



/*------------------- 単項マイナス ------------------- */








/*-------------------- 算術演算子 --------------------- */
/*-------------------- 行列加算(+) -------------------- */

/*-------------------- 行列減算(-) -------------------- */

/*-------------------- 行列乗算(x) -------------------- */




/*------------------- 等価比較演算子 --------------------*/

